# Titanic Surivivor Classification

In [1]:
import numpy as np
import sklearn
import matplotlib.pyplot as plt
import pandas as pd
from glob import glob

## Read data and review

In [2]:
train = pd.read_csv("../data/raw/train.csv")
test = pd.read_csv("../data/raw/test.csv")

## Explore the data

In [3]:
print ("Shape of training data is", train.shape)
print ("Shape of test data is", test.shape)

Shape of training data is (891, 12)
Shape of test data is (418, 11)

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Lets set the "PassengerId" to be the index because it is the identifier unique to each passenger

In [5]:
train.set_index("PassengerId", inplace = True)

In [6]:
print ("The columns of interest are", train.columns)

The columns of interest are Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
# Lets look at su=ome high level summary and dtype information
train.describe()

         Survived      Pclass         Age       SibSp       Parch        Fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
train.dtypes

Survived      int64
Pclass        int64
Name         object
Sex          object
Age         float64
SibSp         int64
Parch         int64
Ticket       object
Fare        float64
Cabin        object
Embarked     object
dtype: object

In [9]:
train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

The dataset has multiple columns. The brief descriptions are given below
- Survived : 0 or 1 for T/F. This is the predicted variable
- Pclass : Passenger class for each passenger. Could be 1, 2, or 3
- Name: Name of each passenger, given in Last, First format
- Sex: male or female, categorical
- Age: age of the passenger
- SibSp : # of siblings / spouses aboard the Titanic
- parch: # of parents / children aboard the Titanic
- ticket: Ticket number
- fare: Passenger fare
- cabin: Cabin number
- embarked: Port of Embarkation; C = Cherbourg, Q = Queenstown, S = Southampton

## Pre- Processing

### Missing Values

In [10]:
train.isna().sum()

Survived      0
Pclass        0
Name          0
Sex           0
Age         177
SibSp         0
Parch         0
Ticket        0
Fare          0
Cabin       687
Embarked      2
dtype: int64

Cabin information is not avialble for majority of passengers. We can remove this parameter from the models.

We also have around 177 missing values in Age and 2 missing values in Embarked. Lets fill these up

In [11]:
# Frequency of embarked port
for port in train.Embarked.unique():
    print (port, sum(train.Embarked == port))

S 644
C 168
Q 77
nan 0

Lets fill in the embarked port to be "S" by default if its missing

In [12]:
train.Embarked.fillna("S", inplace = True)

In [13]:
# For Age, lets fill in missing values by average age of particular gender
print ("Avg age of male passengers is %.2f"%((train[train.Sex == "male"].Age.mean())))
print ("Avg age of female passengers is %.2f"%((train[train.Sex == "female"].Age.mean())))

Avg age of male passengers is 30.73
Avg age of female passengers is 27.92

In [14]:
def fillAge(row):
    if pd.isna(row.Age):
        if row.Sex == "male":
            return (train[train.Sex == "male"].Age.mean())
        else:
            return (train[train.Sex == "female"].Age.mean())
    else:
        return row.Age

train["filledAge"] = train.apply(lambda row : fillAge(row), axis=1)

In [15]:
train.isna().sum()

Survived       0
Pclass         0
Name           0
Sex            0
Age          177
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin        687
Embarked       0
filledAge      0
dtype: int64

Lets perform the following pre-processng steps
- Deal with missing values
- Make Sex, Embarked and Pclass into one-hot encoding

In [47]:
### Extract titles from names

In [89]:
def getTitle(name):
    first = name.split(',')[-1]
    title = first.split('.')[0]
    title = title.strip()
    if title == 'Dona':
        return 'Don'
    return title

In [90]:
train['Title'] = train.Name.apply(getTitle)
train_titles = train.Title.unique()

### One hot encoding

In [91]:
# One-hot encode sex and Pclass
train1 = train.join(pd.get_dummies(train['Sex'], prefix='sex'))
train2 = train1.join(pd.get_dummies(train['Pclass'], prefix = 'Pclass'))
train3 = train2.join(pd.get_dummies(train['Embarked'], prefix = 'Embarked'))

In [92]:
# one hot encode title
train4 = train3.join(pd.get_dummies(train['Title'],prefix = 'Title' ))

In [93]:
train4.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Title_Master,Title_Miss,Title_Mlle,Title_Mme,Title_Mr,Title_Mrs,Title_Ms,Title_Rev,Title_Sir,Title_the Countess
PassengerId,,,,,,,,,,,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,...,0,0,0,0,1,0,0,0,0,0
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,...,0,0,0,0,0,1,0,0,0,0
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,...,0,1,0,0,0,0,0,0,0,0
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,...,0,0,0,0,0,1,0,0,0,0
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,...,0,0,0,0,1,0,0,0,0,0

In [94]:
# Write pre-processed training data to file
# train4.to_csv("../data/interim/train_processed.csv")

## Perform Same pre-processing for test set

In [119]:
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
filledAge        0
Title            0
dtype: int64

Only age has missing values. Lets fill in missing values same way as we did with train

In [96]:
test["filledAge"] = test.apply(lambda row : fillAge(row), axis=1)

In [97]:
# Extract title
test['Title'] = test.Name.apply(getTitle)

In [122]:
# Fill the misisng Fare data
test.Fare.fillna(value = test['Fare'].mean(), inplace = True)

In [123]:
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          327
Embarked         0
filledAge        0
Title            0
dtype: int64

In [124]:
test_titles = test.Title.unique()

In [125]:
# One hot encode
test1 = test.join(pd.get_dummies(test['Sex'], prefix='sex'))
test2 = test1.join(pd.get_dummies(test['Pclass'], prefix = 'Pclass'))
test3 = test2.join(pd.get_dummies(test['Embarked'], prefix = 'Embarked'))
test4 = test3.join(pd.get_dummies(test['Title'],prefix = 'Title' ))

In [126]:
test4.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,...,Embarked_S,Title_Col,Title_Don,Title_Dr,Title_Master,Title_Miss,Title_Mr,Title_Mrs,Title_Ms,Title_Rev
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,...,0,0,0,0,0,0,1,0,0,0
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,...,1,0,0,0,0,0,0,1,0,0
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,...,0,0,0,0,0,0,1,0,0,0
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,...,1,0,0,0,0,0,1,0,0,0
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,...,1,0,0,0,0,0,0,1,0,0

In [127]:
### Reconcile differences and write to files

In [128]:
print ("Unique titles in train data are \n", train_titles)
print ("Unique titles in test data are \n", test_titles)

Unique titles in train data are
 ['Mr' 'Mrs' 'Miss' 'Master' 'Don' 'Rev' 'Dr' 'Mme' 'Ms' 'Major' 'Lady'
 'Sir' 'Mlle' 'Col' 'Capt' 'the Countess' 'Jonkheer']
Unique titles in test data are
 ['Mr' 'Mrs' 'Miss' 'Master' 'Ms' 'Col' 'Rev' 'Dr' 'Don']

In [129]:
titleCols = ['Title_Capt', 'Title_Col', 'Title_Don',
       'Title_Dr', 'Title_Jonkheer', 'Title_Lady', 'Title_Major',
       'Title_Master', 'Title_Miss', 'Title_Mlle', 'Title_Mme', 'Title_Mr',
       'Title_Mrs', 'Title_Ms', 'Title_Rev', 'Title_Sir',
       'Title_the Countess']

In [130]:
for colName in titleCols:
    if colName not in test4.columns:
        test4[colName] = 0

In [131]:
# Need to ensure the titles are common between the two sets
train4.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket',
       'Fare', 'Cabin', 'Embarked', 'filledAge', 'Title', 'sex_female',
       'sex_male', 'Pclass_1', 'Pclass_2', 'Pclass_3', 'Embarked_C',
       'Embarked_Q', 'Embarked_S', 'Title_Capt', 'Title_Col', 'Title_Don',
       'Title_Dr', 'Title_Jonkheer', 'Title_Lady', 'Title_Major',
       'Title_Master', 'Title_Miss', 'Title_Mlle', 'Title_Mme', 'Title_Mr',
       'Title_Mrs', 'Title_Ms', 'Title_Rev', 'Title_Sir',
       'Title_the Countess'],
      dtype='object')

In [132]:
test4.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Ticket', 'Fare', 'Cabin', 'Embarked', 'filledAge', 'Title',
       'sex_female', 'sex_male', 'Pclass_1', 'Pclass_2', 'Pclass_3',
       'Embarked_C', 'Embarked_Q', 'Embarked_S', 'Title_Col', 'Title_Don',
       'Title_Dr', 'Title_Master', 'Title_Miss', 'Title_Mr', 'Title_Mrs',
       'Title_Ms', 'Title_Rev', 'Title_Capt', 'Title_Jonkheer', 'Title_Lady',
       'Title_Major', 'Title_Mlle', 'Title_Mme', 'Title_Sir',
       'Title_the Countess'],
      dtype='object')

In [133]:
# Write to file
train4.to_csv("../data/interim/train_processed.csv")
test4.to_csv("../data/interim/test_processed.csv")